In [1]:
import pandas as pd

In [2]:
# Series as data structure example 
s = pd.Series([10,20,4,7,1] , index=["A", "B", "C", "D","E"])
print(s)

A    10
B    20
C     4
D     7
E     1
dtype: int64

In [3]:
# dataframe example
data = {
"name": ["Alice", "Bob", "Charlie"],
"age": [25, 30, 35],
"city": ["Delhi", "Mumbai", "Bangalore"]
}
 
pd.DataFrame(data)

      name  age       city
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35  Bangalore